Diagram rendering improvements
Former-commit-id: 59558364cfdcd3682b79fa53506dc24c2736fdcc
